app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 0]]
---
  def show
    if params[:artist_id]
      if !(@artist = Artist.find_by(id: params[:artist_id]))
        redirect_to artists_path, alert: "Song not found"
      else
        @song = @artist.songs.find_by(id: params[:id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    redirect_to artists_path if !Artist.find_by(id: params[:artist_id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]
---
  def edit
    if params[:artist_id]
      if !(@artist = Artist.find_by(id: params[:artist_id]))
        redirect_to artists_path, alert: 'Artist Not Found'
      # else
      #   @song = @artist.songs.find_by(id: params[:id])
      #   redirect_to artist_songs_path(@artist), alert: "Song not found" if @song.nil?
      # end
      else
        if @song = @artist.songs.find_by(id: params[:id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "songs" SET "title" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "Mr. Bright"], ["updated_at", "2017-06-04 15:16:01.032403"], ["id", 1]]
---
  def update
    @song = Song.find(params[:id])

    @song.update(song_params)